year = ["январь", "февраль", "март", "апрель",
        "май", "июнь", "июль", "август",
        "сентябрь", "октябрь", "ноябрь", "декабрь"]
season = {"январь": "зима", "февраль": "зима", "март": "весна", "апрель": "весна",
          "май": "весна", "июнь": "лето", "июль": "лето", "август": "лето",
          "сентябрь": "осень", "октябрь": "осень", "ноябрь": "осень", "декабрь": "зима"
          }
month = int(input("Введите номер месяца: ")) - 1
print(f"Вы ввели номер месяца: {year[month]}, который относится к {season.get(year[month])}")
